Repository: maqa588/Strophe
Catalog: Strophe/App/Localizable.xcstrings
Source language: en
Languages: ar, ja, ko, zh_hans, zh_hant

source: About
ar: حول
ja: 情報
ko: 정보
zh_hans: 关于
zh_hant: 關於

source: Active
ar: نشط
ja: アクティブ
ko: 활성
zh_hans: 活动
zh_hant: 活動

source: Add glowing shadow for subtitles
ar: إضافة ظل متوهج للترجمة
ja: 字幕に発光シャドウを追加
ko: 자막에 발광 음영 추가
zh_hans: 为字幕增加发光阴影
zh_hant: 為字幕增加發光陰影

source: Add speaker prefix in subtitles
ar: إضافة بادئة المتحدث في الترجمة
ja: 字幕に話者プレフィックスを追加
ko: 자막에 화자 접두사 추가
zh_hans: 在字幕中添加发言人前缀
zh_hant: 在字幕中添加發言人前綴

# add_speaker_prefix_to_subtitle
source: Add speaker prefix to subtitle lines
ar: إضافة بادئة المتحدث في سطور الترجمة
ja: 字幕行に話者プレフィックスを追加
ko: 자막 행에 화자 접두사 추가
zh_hans: 在字幕行中添加发言人前缀
zh_hant: 在字幕行中添加發言人前綴

source: Add Vocabulary
ar: إضافة مفردات
ja: 語彙を追加
ko: 어휘 추가
zh_hans: 添加词汇
zh_hant: 添加詞彙

# add_vocabulary_drag_hint
source: Add vocabulary, or drag selected text here
ar: إضافة مفردات، أو سحب النص المحدد هنا
ja: 語彙を追加するか、選択したテキストをここにドラッグします
ko: 어휘를 추가하거나 선택한 텍스트를 여기로 드래그하십시오
zh_hans: 添加词汇，也可以把选中的文字拖到这里
zh_hant: 添加詞彙，也可以把選中的文字拖到這裡

source: AI Auto Subtitles
ar: توليد تلقائي للترجمة بالذكاء الاصطناعي
ja: AI自動字幕生成
ko: AI 자동 자막 생성
zh_hans: AI 自动生成字幕
zh_hant: AI 自動生成字幕

source: AI Engine & Model Management
ar: محرك الذكاء الاصطناعي وإدارة النماذج
ja: AIエンジンとモデル管理
ko: AI 엔진 및 모델 관리
zh_hans: AI 引擎与模型管理
zh_hant: AI 引擎與模型管理

source: AI Speech Recognition Timing
ar: توقيت التعرف على الكلام بالذكاء الاصطناعي
ja: AI音声認識タイミング
ko: AI 음성 인식 타이밍
zh_hans: AI 语音识别打轴
zh_hant: AI 語音識別打軸

source: Align Subtitle Block Left
ar: محاذاة كتلة الترجمة ليسار
ja: 字幕ブロックを左寄せ
ko: 자막 블록 좌측 정렬
zh_hans: 字幕块左对齐
zh_hant: 字幕塊左對齊

source: Align Subtitle Block Right
ar: محاذاة كتلة الترجمة لليمين
ja: 字幕ブロックを右寄せ
ko: 자막 블록 우측 정렬
zh_hans: 字幕块右对齐
zh_hant: 字幕塊右對齊

source: Aligner Model
ar: نموذج الموازن
ja: アライナーモデル
ko: 얼라이너 모델
zh_hans: 对齐器模型
zh_hant: 對齊器模型

# all_temporary_transcoding_data_and
source: All temporary transcoding data and waveform cache files have been safely cleared.
ar: تم مسح جميع بيانات تحويل الترميز المؤقتة وملفات ذاكرة التخزين المؤقت للوجة بأمان.
ja: すべての一時的なトランスコードデータと波形キャッシュファイルが安全に消去されました。
ko: 모든 임시 트랜스코딩 데이터와 파형 캐시 파일이 안전하게 삭제되었습니다.
zh_hans: 所有的临时转码数据和波形缓存文件已被安全清除。
zh_hant: 所有的臨時轉碼資料和波形快取檔案已被安全清除。

# api_key_keychain
source: API Key (Saved to Keychain)
ar: مفتاح API (محفوظ في سلسلة المفاتيح)
ja: APIキー（キーチェーンに保存）
ko: API 키 (키체인에 저장)
zh_hans: API 密钥（保存到系统钥匙串）
zh_hant: API 金鑰（儲存至系統鑰匙圈）

source: API Mode
ar: وضع API
ja: APIモード
ko: API 모드
zh_hans: 接口模式
zh_hant: 介面模式

source: Apple Dictionary
ar: قاموس أبل
ja: Apple辞書
ko: Apple 사전
zh_hans: Apple 词典
zh_hant: Apple 詞典

source: Apply
ar: تطبيق
ja: 適用
ko: 적용
zh_hans: 应用
zh_hant: 套用

source: Audio Stream (Coming Soon)
ar: مجرى الصوت (قريباً)
ja: オーディオストリーム（近日公開）
ko: 오디오 스트림 (준비 중)
zh_hans: 音频流 (即将推出)
zh_hant: 音訊流 (即將推出)

# auto_caption_vad_explanation
source: Auto subtitles will first use VAD to generate Speech Islands, then submit to ASR and ForcedAligner.
ar: ستستخدم الترجمات التلقائية أولاً VAD لإنشاء مناطق الكلام، ثم إرسالها إلى ASR و ForcedAligner.
ja: 自動字幕は、まずVADを使用して音声アイランドを生成し、その後ASRとForcedAlignerに送信します。
ko: 자동 자막은 먼저 VAD를 사용하여 음성 영역을 생성한 다음 ASR 및 ForcedAligner로 전달합니다.
zh_hans: 自动字幕会先用 VAD 生成 Speech Islands，再交给 ASR 与 ForcedAligner。
zh_hant: 自動字幕會先用 VAD 生成 Speech Islands，再交給 ASR 與 ForcedAligner。

# auto_create_project_cache
source: Auto Create .strophe Project Cache
ar: إنشاء ذاكرة تخزين مؤقت لمشروع .strophe تلقائيًا
ja: .stropheプロジェクトキャッシュの自動作成
ko: .strophe 프로젝트 캐시 자동 생성
zh_hans: 自动创建 .strophe 工程缓存
zh_hant: 自動建立 .strophe 工程快取

source: Auto Detect
ar: كشف تلقائي
ja: 自動検出
ko: 자동 감지
zh_hans: 自动检测
zh_hant: 自動檢測

source: Auto Line Wrap
ar: التفاف الأسطر تلقائيًا
ja: 自動折り返し
ko: 자동 줄바꿈
zh_hans: 自动换行
zh_hant: 自動換行

# auto_line_wrap_ellipsis
source: Auto Line Wrap…
ar: التفاف الأسطر تلقائيًا…
ja: 自動折り返し…
ko: 자동 줄바꿈…
zh_hans: 自动换行…
zh_hant: 自動換行…

source: Available
ar: متاح
ja: 利用可能
ko: 사용 가능
zh_hans: 可用
zh_hant: 可用

source: Available Models Library
ar: مكتبة النماذج المتاحة
ja: 利用可能なモデルライブラリ
ko: 사용 가능한 모델 라이브러리
zh_hans: 可用模型库
zh_hant: 可用模型庫

source: Back
ar: عودة
ja: 戻る
ko: 뒤로
zh_hans: 返回
zh_hant: 返回

source: Background Music (vocal separation)
ar: موسيقى خلفية (عزل الصوت البشري)
ja: 背景音楽 (ボーカル分離)
ko: 배경 음악 (보컬 분리)
zh_hans: 背景音乐 (人声分离)
zh_hant: 背景音樂 (人聲分離)

source: Batch Translate Subtitles
ar: ترجمة دفعة للترجمة
ja: 字幕の一括翻訳
ko: 자막 일괄 번역
zh_hans: 批量翻译字幕
zh_hant: 批次翻譯字幕

# batch_translate_subtitles_ellipsis
source: Batch Translate Subtitles…
ar: ترجمة دفعة للترجمة…
ja: 字幕の一括翻訳…
ko: 자막 일괄 번역…
zh_hans: 批量翻译字幕…
zh_hant: 批次翻譯字幕…

source: Batch Translating
ar: ترجمة دفعة قيد التشغيل
ja: 一括翻訳中
ko: 일괄 번역 중
zh_hans: 正在批量翻译
zh_hant: 正在批次翻譯

source: Batch Translation Failed
ar: فشلت الترجمة الدفعة
ja: 一括翻訳に失敗しました
ko: 일괄 번역 실패
zh_hans: 批量翻译失败
zh_hant: 批次翻譯失敗

source: Bold
ar: عريض
ja: 太字
ko: 굵게
zh_hans: 粗体
zh_hant: 粗體

# btn_cancel
source: Cancel
ar: إلغاء
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hant: 取消

# btn_save
source: Save
ar: حفظ
ja: 保存
ko: 저장
zh_hans: 保存
zh_hant: 儲存

source: Built-in Sandbox
ar: صندوق حماية مدمج
ja: 内蔵サンドボックス
ko: 내장 샌드박스
zh_hans: 内置沙盒
zh_hant: 內置沙盒

# can_enter_seconds_mmss_or
source: Can enter seconds, MM:SS, or HH:MM:SS
ar: يمكن إدخال الثواني، MM:SS أو HH:MM:SS
ja: 秒数、MM:SS、またはHH:MM:SSを入力可能
ko: 초 단위, MM:SS 또는 HH:MM:SS 입력 가능
zh_hans: 可输入秒数、MM:SS 或 HH:MM:SS
zh_hant: 可輸入秒數、MM:SS 或 HH:MM:SS

source: Cancel
ar: إلغاء
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hant: 取消

source: Cancel Import
ar: إلغاء الاستيراد
ja: インポートをキャンセル
ko: 가져오기 취소
zh_hans: 取消导入
zh_hant: 取消匯入

# cancel_import_1
source: Cancel Import
ar: إلغاء الاستيراد
ja: インポートを中止
ko: 가져오기 취소
zh_hans: 放弃导入
zh_hant: 放棄匯入

source: Cancel Tag
ar: إلغاء التحديد
ja: マーク解除
ko: 태그 취소
zh_hans: 取消标记
zh_hant: 取消標記

source: Cannot Merge
ar: تعذر الدمج
ja: 結合できません
ko: 병합할 수 없음
zh_hans: 无法合并
zh_hant: 無法合併

source: Cannot Open Project
ar: لا يمكن فتح المشروع
ja: プロジェクトを開けません
ko: 프로젝트를 open할 수 없음
zh_hans: 无法打开项目
zh_hant: 無法開啟專案

source: Cannot Split
ar: تعذر التقسيم
ja: 分割できません
ko: 분할할 수 없음
zh_hans: 无法切分
zh_hant: 無法切分

source: Change display time
ar: تغيير وقت العرض
ja: 表示時間を変更
ko: 표시 시간 변경
zh_hans: 更改显示时间
zh_hant: 更改顯示時間

source: Chinese to Pinyin
ar: تحويل الحروف الصينية إلى بينيين
ja: 漢字からピンイン
ko: 한자를 병음으로
zh_hans: 汉字转拼音
zh_hant: 漢字轉拼音

# chinese_to_pinyin_ellipsis
source: Chinese to Pinyin…
ar: تحويل الحروف الصينية إلى بينيين…
ja: 漢字からピンイン…
ko: 한자를 병음으로…
zh_hans: 汉字转拼音…
zh_hant: 漢字轉拼音…

source: Cleaning up...
ar: جاري التنظيف...
ja: クリーンアップ中...
ko: 정리 중...
zh_hans: 正在清理中...
zh_hant: 正在清理中...

source: Cleanup completed
ar: اكتمل التنظيف
ja: クリーンアップ完了
ko: 정리 완료
zh_hans: 清理完成
zh_hant: 清理完成

source: Clear Cache
ar: تنظيف ذاكرة التخزين المؤقت
ja: キャッシュをクリア
ko: 캐시 정리
zh_hans: 清理缓存
zh_hant: 清理快取

source: Clear Cache Now
ar: تنظيف ذاكرة التخزين المؤقت الآن
ja: 今すぐキャッシュをクリア
ko: 지금 캐시 정리
zh_hans: 立即清理缓存
zh_hant: 立即清理快取

source: Clear Group Text
ar: مسح نص المجموعة
ja: グループテキストをクリア
ko: 그룹 텍스트 지우기
zh_hans: 清空分组文字
zh_hant: 清空分組文字

source: Clear Text within Group
ar: مسح النص داخل المجموعة
ja: グループ内テキストをクリア
ko: 그룹 내 텍스트 지우기
zh_hans: 清空组内文字
zh_hant: 清空組內文字

source: Clear Translation
ar: مسح الترجمة
ja: 翻訳をクリア
ko: 번역 지우기
zh_hans: 清空译文
zh_hant: 清空譯文

# click_character_spacing_to_move
source: Click character spacing to move the word segment cursor
ar: انقر فوق تباعد الأحرف لتحريك مؤشر تقسيم الكلمات
ja: 文字間隔をクリックして単語分割カーソルを移動します
ko: 문자 간격을 클릭하여 단어 분할 커서를 이동합니다
zh_hans: 点击字符间隔移动分词游标
zh_hant: 點擊字元間隔移動分詞遊標

# click_to_toggle_real_time
source: · Click to toggle real-time soft subtitle preview in player
ar: · انقر لتبديل معاينة الترجمة البرمجية في الوقت الفعلي في المشغل
ja: · クリックしてプレイヤーでのリアルタイムなソフト字幕プレビューを切り替えます
ko: · 플레이어에서 실시간 소프트 자막 미리보기를 켜거나 끄려면 클릭하세요
zh_hans: · 点击开启/关闭视频软字幕实时预览
zh_hant: · 點擊以啟用/停用影片軟字幕即時預覽

# click_to_turn_onoff_the
source: Click to turn on/off the live preview of video hard subtitles
ar: انقر لتشغيل/إيقاف المعاينة المباشرة للترجمة المدمجة للفيديو
ja: クリックしてビデオハード字幕のリアルタイムプレビューをオン/オフにします
ko: 클릭하여 비디오 하드 자막 실시간 미리보기를 켜거나 끕니다
zh_hans: 点击开启/关闭视频硬字幕实时预览
zh_hant: 點擊開啟/關閉影片硬字幕即時預覽

source: Close
ar: إغلاق
ja: 閉じる
ko: 닫기
zh_hans: 关闭
zh_hant: 關閉

# close_vad_explanation
source: When closed, only VAD and Qwen3-ASR will be used to generate timeline.
ar: عند إغلاقه، سيتم استخدام VAD و Qwen3-ASR فقط لإنشاء الخط الزمني.
ja: 閉じた場合、VADとQwen3-ASRのみを使用してタイムラインを生成します。
ko: 비활성화 시 VAD 및 Qwen3-ASR만 사용하여 템플릿을 생성합니다.
zh_hans: 关闭后仅使用 VAD 与 Qwen3-ASR 生成粗略时间轴。
zh_hant: 關閉後僅使用 VAD 與 Qwen3-ASR 生成粗略時間軸。

source: Cloud
ar: سحابة
ja: クラウド
ko: 클라우드
zh_hans: 云端
zh_hant: 雲端

# cloud_ai_speech_timing
source: Cloud AI Speech Recognition Timing
ar: مزامنة الكلام بالذكاء الاصطناعي السحابي
ja: クラウドAI音声認識タイミング
ko: 클라우드 AI 음성 인식 정렬
zh_hans: 云端 AI 语音识别打轴
zh_hant: 雲端 AI 語音識別打軸

source: Cloud Generate Subtitles
ar: إنشاء ترجمات سحابية
ja: クラウドで字幕生成
ko: 클라우드 자막 생성
zh_hans: 云端生成字幕
zh_hant: 雲端生成字幕

source: Cloud Recognition
ar: تعرف سحابي
ja: クラウド認識
ko: 클라우드 인식
zh_hans: 云端识别
zh_hant: 雲端識別

source: Cloud Speech Recognition Config
ar: تكوين التعرف على الكلام السحابي
ja: クラウド音声認識構成
ko: 클라우드 음성 인식 설정
zh_hans: 云端语音识别配置
zh_hant: 雲端語音識別配置

source: Color
ar: اللون
ja: 色
ko: 색상
zh_hans: 颜色
zh_hant: 顏色

source: Common Vocabulary
ar: مفردات شائعة
ja: 常用語彙
ko: 상용 어휘
zh_hans: 常用词汇
zh_hant: 常用詞彙

# config_required_for_recognition
source: Configuration required before using cloud or local recognition.
ar: يلزم التكوين قبل استخدام التعرف السحابي أو المحلي.
ja: クラウドおよびローカル認識を使用する前に構成が必要です。
ko: 클라우드 또는 로컬 인식을 사용하기 전에 설정이 필요합니다.
zh_hans: 云端和本地识别均需先进行相关参数与提交语言配置。
zh_hant: 雲端和本地識別均需先進行相關參數與提交語言配置。

source: Confirm Split
ar: تأكيد التقسيم
ja: 分割を確認
ko: 분할 확인
zh_hans: 确认切分
zh_hant: 確認切分

source: Continue
ar: متابعة
ja: 続行
ko: 계속
zh_hans: 继续
zh_hant: 繼續

source: Continue Import
ar: متابعة الاستيراد
ja: インポートを続行
ko: 가져오기 계속
zh_hans: 继续导入
zh_hant: 繼續匯入

source: Control Method
ar: طريقة التحكم
ja: コントロール方法
ko: 제어 방식
zh_hans: 控制方式
zh_hant: 控制方式

source: Copy
ar: نسخ
ja: コピー
ko: 복사
zh_hans: 复制
zh_hant: 複製

source: Copy Original to Translation
ar: نسخ النص الأصلي إلى الترجمة
ja: 原文を翻訳にコピー
ko: 원본을 번역에 복사
zh_hans: 复制原文到译文
zh_hant: 複製原文到譯文

source: Copy Style
ar: نسخ النمط
ja: スタイルをコピー
ko: 스타일 복사
zh_hans: 复制样式
zh_hant: 複製樣式

source: Copy Subtitle Block
ar: نسخ كتلة الترجمة
ja: 字幕ブロックをコピー
ko: 자막 블록 복사
zh_hans: 复制字幕块
zh_hant: 複製字幕塊

# copyright_text
source: © 2026 Strophe. All rights reserved.
ar: © 2026 Strophe. جميع الحقوق محفوظة.

source: CoreML Acceleration
ar: تسريع CoreML
ja: CoreMLアクセラレーション
ko: CoreML 가속
zh_hans: CoreML 加速组件
zh_hant: CoreML 加速組件

# coreml_acceleration_for_qwen3_explanation
source: CoreML INT8 audio encoder acceleration for qwen3-asr-0.6b; 0.6B/1.7B MLX models can still run independently.
ar: تسريع مشفر الصوت CoreML INT8 لنموذج qwen3-asr-0.6b؛ لا تزال نماذج MLX 0.6B/1.7B تعمل بشكل مستقل.
ja: qwen3-asr-0.6b用のCoreML INT8オーディオエンコーダーアクセラレーション。0.6B / 1.7B MLXモデルは引き続き独立して実行できます。
ko: qwen3-asr-0.6b용 CoreML INT8 오디오 인코더 가속. 0.6B / 1.7B MLX 모델은 계속 독자적으로 실행할 수 있습니다.
zh_hans: 用于 qwen3-asr-0.6b 的 CoreML INT8 音频编码器加速；0.6B/1.7B MLX 模型仍可独立运行。
zh_hant: 用於 qwen3-asr-0.6b 的 CoreML INT8 音訊編碼器加速；0.6B/1.7B MLX 模型仍可獨立運行。

# coreml_compatibility_explanation
source: Current CoreML encoder only supports qwen3-asr-0.6b; other models run on MLX.
ar: يدعم مشفر CoreML الحالي qwen3-asr-0.6b فقط؛ تعمل النماذج الأخرى على MLX.
ja: 現在のCoreMLエンコーダーはqwen3-asr-0.6bのみをサポートします。その他のモデルはMLXで実行されます。
ko: 현재 CoreML 인코더는 qwen3-asr-0.6b만 지원합니다. 다른 모델은 MLX에서 실행됩니다.
zh_hans: 当前 CoreML 编码器仅兼容 qwen3-asr-0.6b；该模型将使用 MLX 独立运行。
zh_hant: 當前 CoreML 編碼器僅相容 qwen3-asr-0.6b；該模型將使用 MLX 獨立運行。

# coreml_encoder_downloaded
source: CoreML INT8 encoder downloaded, will mix with MLX model.
ar: تم تنزيل مشفر CoreML INT8، وسيتم مزجه مع نموذج MLX الحالي.
ja: CoreML INT8エンコーダーがダウンロードされました。現在のMLXモデルと混合して使用されます。
ko: CoreML INT8 인코더가 다운로드되었습니다. 현재 MLX 모델과 혼합하여 사용됩니다.
zh_hans: CoreML INT8 编码器已下载，将与当前 MLX 模型混合使用。
zh_hant: CoreML INT8 編碼器已下載，將與當前 MLX 模型混合使用。

# coreml_encoder_not_downloaded
source: CoreML INT8 encoder not downloaded, will auto download when generating.
ar: لم يتم تنزيل مشفر CoreML INT8، وسيتم تنزيله تلقائيًا عند البدء.
ja: CoreML INT8エンコーダーはダウンロードされていません。生成開始時に自動ダウンロードされます。
ko: CoreML INT8 인코더가 다운로드되지 않았습니다. 생성 시 자동 다운로드됩니다.
zh_hans: CoreML INT8 编码器尚未下载，开始生成时会自动下载。
zh_hant: CoreML INT8 編碼器尚未下載，開始生成时会自动下载。

source: Create
ar: إنشاء
ja: 作成
ko: 생성
zh_hans: 创建
zh_hant: 創建

source: Create Subtitle Block
ar: إنشاء كتلة ترجمة
ja: 字幕ブロックを作成
ko: 자막 블록 생성
zh_hans: 创建字幕块
zh_hant: 建立字幕區塊

source: CRF (Constant Rate Factor)
ar: CRF (عامل جودة الصورة)
ja: CRF (画質係数)
ko: CRF (화질 계수)
zh_hans: CRF (画质系数)
zh_hant: CRF (畫質係數)

# crf_value_explanation
source: Lower CRF means higher quality, slower export, and larger file.
ar: يعني انخفاض CRF جودة أعلى، وتصديرًا أبطأ، وملفًا أكبر.
ja: CRF値が低いほど高品質になり、エクスポートが遅くなり、ファイルが大きくなります。
ko: CRF 값이 낮을수록 화질이 높아지고 내보내기가 느려지며 파일이 커집니다.
zh_hans: 数字越小画质越高，导出速度也会相应变慢，同时文件会变大。
zh_hant: 數字越小畫質越高，匯出速度也會相應变慢，同時檔案會变大。

source: Current Video Resolution & Preview Scale
ar: دقة الفيديو الحالية ومقياس المعاينة
ja: 現在のビデオ解像度とプレビュー縮尺
ko: 현재 비디오 해상도 및 미리보기 비율
zh_hans: 当前视频分辨率与预览缩放比例
zh_hant: 當前視訊解析度與預覽縮放比例

source: Cut Subtitle Block
ar: قص كتلة الترجمة
ja: 字幕ブロックを切り取り
ko: 자막 블록 잘라내기
zh_hans: 剪切字幕块
zh_hant: 剪切字幕塊

source: Delete
ar: حذف
ja: 削除
ko: 삭제
zh_hans: 删除
zh_hant: 刪除

# delete_cached_project_confirm
source: Delete cached project?
ar: حذف المشروع المخزن مؤقتًا؟
ja: キャッシュされたプロジェクトを削除しますか？
ko: 캐시된 프로젝트를 삭제할까요?
zh_hans: 删除缓存项目？
zh_hant: 刪除快取項目？

source: Delete Group
ar: حذف المجموعة
ja: グループを削除
ko: 그룹 삭제
zh_hans: 删除分组
zh_hant: 刪除分組

source: Delete Group Subtitles
ar: حذف ترجمات المجموعة
ja: グループ字幕を削除
ko: 그룹 자막 삭제
zh_hans: 删除分组字幕
zh_hant: 刪除分組字幕

source: Delete Project Cache
ar: حذف ذاكرة التخزين المؤقت للمشروع
ja: プロジェクトキャッシュを削除
ko: 프로젝트 캐시 삭제
zh_hans: 删除工程缓存
zh_hant: 刪除工程快取

source: Delete Style
ar: حذف النمط
ja: スタイルを削除
ko: 스타일 삭제
zh_hans: 删除样式
zh_hant: 刪除樣式

source: Delete Subtitle
ar: حذف الترجمة
ja: 字幕を削除
ko: 자막 삭제
zh_hans: 删除字幕
zh_hant: 刪除字幕

source: Delete subtitle blocks within group
ar: حذف كتل الترجمة داخل المجموعة
ja: グループ内の字幕ブロックを削除
ko: 그룹 내 자막 블록 삭제
zh_hans: 删除组内字幕块
zh_hant: 刪除組內字幕塊

source: Description
ar: الوصف
ja: 説明
ko: 설명
zh_hans: 描述
zh_hant: 描述

source: Dictionary
ar: قاموس
ja: 辞書
ko: 사전
zh_hans: 词典
zh_hant: 詞典

# disable_vad_explanation
source: When VAD is disabled, audio is divided into uniform 20-second segments to ensure stable and continuous long audio transcription.
ar: عند تعطيل VAD، سيتم تقسيم الصوت إلى مقاطع متساوية بطول 20 ثانية لضمان استقرار واستمرارية التعرف على الصوت الطويل.
ja: VADを無効にすると、長時間のオーディオを安定して連続的に認識できるように、オーディオが20秒ごとに均等に分割されます。
ko: VAD를 비활성화하면 오디오가 20초 단위로 균일하게 분할되어 긴 오디오의 안정적이고 연속적인 음성 인식을 수행합니다.
zh_hans: 关闭 VAD 后，音频将按每段 20 秒均匀切分，以实现长音频的稳定连续识别。
zh_hant: 關閉 VAD 後，音訊將按每段 20 秒均勻切分，以實現長音訊的穩定連續識別。

# discard_original_project_confirm
source: Discard original project?
ar: تجاهل المشروع الأصلي؟
ja: 元のプロジェクトを破棄しますか？
ko: 원본 프로젝트를 삭제할까요?
zh_hans: 是否要丢弃原工程？
zh_hant: 是否要丟棄原工程？

source: Do Not Process
ar: عدم المعالجة
ja: 処理しない
ko: 처리하지 않음
zh_hans: 不处理
zh_hant: 不處理

source: Do Not Restore
ar: لا تسترجع
ja: 復元しない
ko: 복원하지 않음
zh_hans: 不恢复
zh_hant: 不恢復

source: Done
ar: تم
ja: 完了
ko: 완료
zh_hans: 完成
zh_hant: 完成

source: Don’t Save
ar: عدم الحفظ
ja: 保存しない
ko: 저장하지 않음
zh_hans: 不保存
zh_hant: 不儲存

source: Draft Subtitle
ar: ترجمة مسودة
ja: 新規字幕
ko: 새 자막
zh_hans: 待录入字幕
zh_hant: 待輸入字幕

# drag_timeline_to_create_subtitle
source: · Drag timeline to create subtitle segments · Double-click empty area to create a 2s block · Slap J/K keys in real-time during playback
ar: · اسحب على المخطط الزمني لإنشاء مقاطع الترجمة · انقر نقرًا مزدوجًا لإنشاء كتلة مدتها ثانيتان · اضغط على مفاتيح J/K في الوقت الفعلي أثناء التشغيل
ja: · タイムラインをドラッグして字幕をすばやく作成 · 空白部分をダブルクリックして2秒の字幕を作成 · J/Kキーを押して再生中にリアルタイムで拍打打軸
ko: · 타임라인을 드래그하여 자막 세그먼트 빠른 생성 · 빈 영역을 더블 클릭하여 2초 자막 블록 생성 · 재생 중 J/K 키를 눌러 실시간 비트 타이밍
zh_hans: · 在时间轴拖选区快速创建字幕 · 双击时间轴空白新建 2 秒字幕块 · 按住 J/K 键配合视频播放实时拍打定位
zh_hant: · 在時間軸拖曳選區快速建立字幕 · 按兩下時間軸空白處新建 2 秒字幕區塊 · 按住 J/K 鍵配合影片播放即時拍打定位

# drop_media_prompt
source: Drop a video or audio file here, or click to import
ar: قم بإسقاط ملف فيديو أو صوت هنا، أو انقر للاستيراد
ja: ここにビデオまたはオーディオファイルをドロップするか、クリックしてインポートします
ko: 여기에 비디오 또는 오디오 파일을 드롭하거나 클릭하여 가져옵니다
zh_hans: 拖入视频或音频文件，或点击导入
zh_hant: 拖放影片或音訊檔案至此，或點擊以匯入

source: Edit Content
ar: تحرير المحتوى
ja: 内容を編集
ko: 내용 편집
zh_hans: 编辑内容
zh_hant: 編輯內容

# edit_script_text_drag_timeline
source: · Edit script text · Drag timeline playhead · Select and edit subtitles normally
ar: · تتيح تعديل نص السيناريو · تمكن من سحب مؤشر التشغيل للمخطط الزمني · اختيار الترجمة وتحريرها بشكل طبيعي
ja: · 左側のスクリプトテキストを編集可能 · タイムラインの再生ヘッドをドラッグ可能 · 通常の字幕選択と編集
ko: · 왼쪽 스크립트 수정 가능 · 타임라인 재생 헤드 드래그 가능 · 일반적인 자막 선택 및 편집
zh_hans: · 可以修改左侧文稿文字 · 可以拖动时间轴标尺 · 正常选择和编辑字幕
zh_hant: · 可以修改左側文稿文字 · 可以拖曳時間軸尺規 · 正常選取與編輯字幕

source: Edit Style
ar: تعديل النمط
ja: スタイルを編集
ko: 스타일 편집
zh_hans: 编辑样式
zh_hant: 編輯樣式

source: Edit Subtitle Content
ar: تحرير محتوى الترجمة
ja: 字幕内容を編集
ko: 자막 내용 편집
zh_hans: 编辑字幕内容
zh_hant: 編輯字幕內容

source: Edit Text
ar: تحرير النص
ja: テキストを編集
ko: 텍스트 편집
zh_hans: 编辑文本
zh_hant: 編輯文字

source: Editor
ar: المحرر
ja: エディター
ko: 편집기
zh_hans: 编辑器
zh_hant: 編輯器

source: Enable CoreML Encoder Acceleration
ar: تمكين تسريع مشفر CoreML
ja: CoreMLエンコーダーアクセラレーションを有効化
ko: CoreML 인코더 가속 활성화
zh_hans: 启用 CoreML 编码器加速
zh_hant: 啟用 CoreML 編碼器加速

source: Enable Speaker Diarization (Pyannote)
ar: تمكين التعرف على المتحدث (Pyannote)
ja: 話者認識を有効にする (Pyannote)
ko: 화자 인식 활성화 (Pyannote)
zh_hans: 启用对话人识别 (Pyannote)
zh_hant: 啟用對話人識別 (Pyannote)

source: Enable Timeline Refinement
ar: تمكين تحسين الخط الزمني
ja: タイムライン調整を有効化
ko: 정밀 조정 활성화
zh_hans: 启用时间轴精修
zh_hant: 啟用時間軸精修

source: Encoding
ar: الترميز
ja: エンコーディング
ko: 인코딩
zh_hans: 编码
zh_hant: 編碼

source: End time, e.g., 01:25.20
ar: وقت النهاية، مثل 01:25.20
ja: 終了時間、例：01:25.20
ko: 종료 시간, 예: 01:25.20
zh_hans: 结束时间，例如 01:25.20
zh_hant: 結束時間，例如 01:25.20

# enter_sample_text_for_live
source: Enter sample text for live preview, will not modify subtitle content
ar: أدخل نصًا عينيًا للمعاينة في الوقت الفعلي، فلن يتم تعديل محتوى الترجمة
ja: リアルタイムプレビュー用のサンプルテキストを入力します。字幕内容は変更されません
ko: 실시간 미리보기를 위한 샘플 텍스트를 입력하십시오. 자막 내용은 변경되지 않습니다
zh_hans: 输入用于实时预览的样本文本，不会修改字幕内容
zh_hant: 輸入用於即時預覽的樣本文本，不會修改字幕內容

source: Error
ar: خطأ
ja: エラー
ko: 오류
zh_hans: 错误
zh_hant: 錯誤

source: Example: [Speaker 0] Hello, world.
ar: مثال: [Speaker 0] مرحبًا بالعالم.
ja: 例: [Speaker 0] こんにちは、世界。
ko: 예: [Speaker 0] 안녕하세요, 세상.
zh_hans: 例如: [Speaker 0] 你好，世界。
zh_hant: 例如: [Speaker 0] 你好，世界。

# experimental_yuv_buffer_explanation
source: Experimental option: try writing H.264/H.265 using YUV buffer.
ar: خيار تجريبي: حاول كتابة H.264/H.265 باستخدام مخزن YUV المؤقت.
ja: 実験的オプション：YUVバッファを使用したH.264/H.265の書き込みを試みます。
ko: 실험적 옵션: YUV 버퍼를 사용한 H.264/H.265 쓰기를 시도합니다.
zh_hans: 实验选项。尝试用更接近硬件编码器的 YUV 缓冲写入 H.264/H.265；若导出失败或颜色异常，请关闭。
zh_hant: 實驗選項。嘗試用更接近硬體編碼器的 YUV 緩衝寫入 H.264/H.265；若匯出失敗或顏色異常，請關閉。

source: Export
ar: تصدير
ja: エクスポート
ko: 내보내기
zh_hans: 导出
zh_hant: 導出

# export_2pass_encoding
source: 2-pass Encoding
ar: ترميز ثنائي الممر
ja: 2パスエンコーディング
ko: 2패스 인코딩
zh_hans: 2-pass 多遍编码
zh_hant: 2-pass 多遍編碼

source: Export subtitles or share project
ar: تصدير الترجمة أو مشاركة المشروع
ja: 字幕のエクスポートまたはプロジェクトの共有
ko: 자막 내보내기 또는 프로젝트 공유
zh_hans: 导出字幕或分享项目
zh_hant: 導出字幕或分享專案

source: Exporting hard subtitled video
ar: جاري تصدير فيديو بترجمة مدمجة
ja: ハード字幕付きビデオをエクスポート中
ko: 하드 자막 비디오 내보내는 중
zh_hans: 正在导出硬字幕视频
zh_hant: 正在導出硬字幕影片

source: External Hard Drive
ar: قرص صلب خارجي
ja: 外付けハードディスク
ko: 외장 하드 드라이브
zh_hans: 外置硬盘
zh_hant: 外置硬碟

source: Follow Group Style
ar: اتباع نمط المجموعة
ja: グループスタイルに従う
ko: 그룹 스타일 따르기
zh_hans: 跟随小组样式
zh_hant: 跟隨小組樣式

source: Font
ar: الخط
ja: フォント
ko: 글꼴
zh_hans: 字体
zh_hant: 字體

source: Font Size
ar: حجم الخط
ja: フォントサイズ
ko: 글꼴 크기
zh_hans: 字号
zh_hant: 字號

# for_songs_it_is_recommended
source: For songs, it is recommended to paste line-by-line lyrics; the system will skip free recognition and directly force align according to these lyrics.
ar: يُنصح بلصق كلمات الأغاني سطرًا بسطر؛ سيتخطى النظام التعرف الحر ويقوم بالمحاذاة القسرية مباشرة وفقًا لهذه الكلمات.
ja: 歌の場合は、歌詞を1行ずつ貼り付けることをお勧めします。システムは自由認識をスキップし、これらの歌詞に従って直接強制アライメントを行います。
ko: 노래의 경우 가사를 한 줄씩 붙여넣는 것이 좋습니다. 시스템은 일반 인식을 건너뛰고 이 가사에 따라 직접 강제 정렬을 수행합니다.
zh_hans: 歌曲建议粘贴逐行歌词；系统会跳过自由识别，直接按这些歌词强制对齐。
zh_hant: 歌曲建議粘貼逐行歌詞；系統會跳過自由識別，直接按這些歌詞強制對齊。

source: Forced Alignment Config (Qwen3-ForcedAligner)
ar: تكوين المحاذاة القسرية (Qwen3-ForcedAligner)
ja: 強制アライメント構成 (Qwen3-ForcedAligner)
ko: 강제 정렬 구성 (Qwen3-ForcedAligner)
zh_hans: 强制对齐配置 (Qwen3-ForcedAligner)
zh_hant: 強制對齊配置 (Qwen3-ForcedAligner)

source: Forced Alignment Settings
ar: إعدادات المحاذاة القسرية
ja: 強制アライメント設定
ko: 강제 정렬 설정
zh_hans: 强制对齐设置
zh_hant: 強制對齊設定

source: Format Compatibility Notice
ar: تنبيه توافق الصيغة
ja: 形式互換性のヒント
ko: 포맷 호환성 안내
zh_hans: 格式兼容性提示
zh_hant: 格式相容性提示

# format_lrc
source: Lyrics (.lrc)
ar: كلمات الأغاني (.lrc)
ja: 歌詞ファイル (.lrc)
ko: 가사 파일 (.lrc)
zh_hans: 歌词文件 (.lrc)
zh_hant: 歌詞檔案 (.lrc)

# format_soft_subtitles
source: Soft Subtitles
ar: ترجمة نصية (ناعمة)
ja: ソフト字幕
ko: 소프트 자막
zh_hans: 软字幕
zh_hant: 軟字幕

source: Full Sentence
ar: جملة كاملة
ja: フルセンテンス
ko: 전체 문장
zh_hans: 完整句子
zh_hant: 完整句子

source: Generation Failed
ar: فشل الإنشاء
ja: 生成に失敗しました
ko: 생성 실패
zh_hans: 生成失败
zh_hant: 生成失敗

source: Glow
ar: توهج
ja: グロウ
ko: 글로우
zh_hans: 流光
zh_hant: 流光

source: Glow Special Effect (Glow)
ar: تأثير التوهج الخاص (Glow)
ja: グロウ特殊効果 (Glow)
ko: 글로우 특수 효과 (Glow)
zh_hans: 流光特效 (Glow)
zh_hant: 流光特效 (Glow)

source: Got It
ar: فهمت
ja: 了解
ko: 확인
zh_hans: 我知道了
zh_hant: 我知道了

source: Group
ar: الفئة
ja: グループ
ko: 그룹
zh_hans: 组别
zh_hant: 組別

source: Group Info
ar: معلومات المجموعة
ja: グループ情報
ko: 그룹 정보
zh_hans: 分组信息
zh_hant: 分組資訊

source: Group Name
ar: اسم المجموعة
ja: グループ名
ko: 그룹 이름
zh_hans: 分组名称
zh_hant: 分組名稱

source: Hard Subtitle Export
ar: تصدير الترجمة المدمجة
ja: ハード字幕エクスポート
ko: 하드 자막 내보내기
zh_hans: 硬字幕导出
zh_hant: 硬字幕導出

source: Hard subtitle export cancelled.
ar: تم إلغاء تصدير الترجمة المدمجة.
ja: ハード字幕のエクスポートがキャンセルされました。
ko: 하드 자막 내보내기가 취소되었습니다.
zh_hans: 硬字幕导出已取消。
zh_hant: 硬字幕導出已取消。

source: Hard subtitle frame composition failed.
ar: فشل تركيب إطار الترجمة المدمجة.
ja: ハード字幕フレームの合成に失敗しました。
ko: 하드 자막 프레임 합성에 실패했습니다.
zh_hans: 硬字幕帧合成失败。
zh_hant: 硬字幕幀合成失敗。

source: Hard Subtitle Preview
ar: معاينة الترجمة المدمجة
ja: ハード字幕プレビュー
ko: 하드 자막 미리보기
zh_hans: 硬字幕预览
zh_hant: 硬字幕預覽

# hard_subtitled_video_ellipsis
source: Hard Subtitled Video…
ar: فيديو بترجمة مدمجة…
ja: ハード字幕付きビデオ…
ko: 하드 자막 비디오…
zh_hans: 硬字幕视频…
zh_hant: 硬字幕影片…

source: Hard Subtitled Video Export
ar: تصدير فيديو بترجمة مدمجة
ja: ハード字幕ビデオエクスポート
ko: 하드 자막 비디오 내보내기
zh_hans: 硬字幕视频导出
zh_hant: 硬字幕影片導出

source: Hide subtitles of this group
ar: إخفاء ترجمات هذه المجموعة
ja: このグループの字幕を非表示
ko: 이 그룹의 자막 숨기기
zh_hans: 隐藏此组字幕
zh_hant: 隱藏此組字幕

source: Hide this group
ar: إخفاء هذه المجموعة
ja: このグループを非表示
ko: 이 그룹 숨기기
zh_hans: 隐藏此组
zh_hant: 隱藏此組

source: Hold: Start / Release: End
ar: اضغط للبدء / افلت للإنهاء
ja: 長押しで開始 / 離して終了
ko: 누르고 있으면 시작 / 떼면 종료
zh_hans: 按住开始 / 松开结束
zh_hant: 按住開始 / 鬆開結束

# if_enabled_the_videos_pixel
source: If enabled, the video's pixel aspect ratio and clean aperture will be read. For example, a video stored as 1920×1080 but displayed as 4:3 will be re-synthesized at a real display size such as 1440×1080 to avoid image distortion.
ar: عند التفعيل، سيتم قراءة نسبة العرض إلى الارتفاع للبكسل والفتحة النظيفة للفيديو. على سبيل المثال، الفيديو المخزن كـ 1920×1080 والمعروض بنسبة 4:3 سيتم إعادة تركيبه بالحجم الفعلي للعرض مثل 1440×1080 لتجنب تشويه الصورة.
ja: 有効にすると、ビデオのピクセルアスペクト比とクリーンアパーチャが読み込まれます。たとえば、1920×1080で保存され、4:3で表示されるビデオは、歪みを防ぐために1440×1080のような実際の表示サイズで再合成されます。
ko: 활성화하면 비디오의 픽셀 종횡비와 clean aperture를 읽습니다. 예를 들어, 1920×1080으로 저장되고 4:3으로 표시되는 비디오는 왜곡을 방지하기 위해 1440×1080과 같은 실제 표시 크기로 다시 합성됩니다.
zh_hans: 开启后会读取视频的像素宽高比和 clean aperture。比如存储为 1920×1080、显示为 4:3 的视频，会按 1440×1080 这类真实显示尺寸重新合成，避免画面被挤歪。
zh_hant: 開啟後會讀取影片的像素寬高比和 clean aperture。比如儲存為 1920×1080、顯示為 4:3 的影片，會按 1440×1080 這類真實顯示尺寸重新合成，避免畫面被擠歪。
